it/src/DataProcessors/АнализЖивогоИМертвогоСофта/АнализЖивогоИМертвогоСофта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АнализЖивогоИМертвогоСофта</name>
  <attributes>
    <name>ВариантОтчета</name>
    <type>
      <types>EnumRef.ВариантыАнализаЖивогоИМертвогоСофта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУстановлено</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУстановлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПрограммы</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияНакопления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

it/src/AccumulationRegisters/РазмещениеЛицензий/РазмещениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеЛицензий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУстановлено</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/AccumulationRegisters/РазмещениеОбъектов/РазмещениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеОбъектов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПризнакУчета</name>
    <type>
      <types>EnumRef.ПризнакУчетаПрограмм</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКомпьютера</name>
    <type>
      <types>CatalogRef.ОбъектыКомпьютера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/InformationRegisters/ОбязательныйСофтОрганизаций/ОбязательныйСофтОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбязательныйСофтОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/InformationRegisters/МестонахождениеОС/МестонахождениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахождениеОС</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещение</types>
    </type>
  </resources>
  <resources>
    <name>ОСВладелец</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ИмяДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/Enums/ВидДвиженияНакопления/ВидДвиженияНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвиженияНакопления</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

it/src/Enums/ПризнакУчетаПрограмм/ПризнакУчетаПрограмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакУчетаПрограмм</name>
  <enumValues>
    <name>Удалить</name>
  </enumValues>
  <enumValues>
    <name>НеУчитывать</name>
  </enumValues>
  <enumValues>
    <name>Учитывать</name>
  </enumValues>
  <enumValues>
    <name>НеОпределено</name>
  </enumValues>
</mdclass:Enum>

it/src/Enums/ВариантыРазмещенияЛицензий/ВариантыРазмещенияЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРазмещенияЛицензий</name>
  <enumValues>
    <name>НаРабочееМесто</name>
  </enumValues>
  <enumValues>
    <name>НаОрганизацию</name>
  </enumValues>
</mdclass:Enum>

it/src/DataProcessors/АнализЖивогоИМертвогоСофта/ManagerModule.bsl
Функция ЗаполнитьМертвыйСофт() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазмещеноЛицензии.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |	РазмещеноЛицензии.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |	ЕСТЬNULL(УстановленоОбъектов.КоличествоУстановлено, 0) КАК КоличествоУстановлено,
	               |	ИСТИНА КАК Флаг,
	               |	РазмещеноЛицензии.Организация,
	               |	РазмещеноЛицензии.ПодразделениеОрганизации,
	               |	РазмещеноЛицензии.Лицензия,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	РазмещеноЛицензии.Лицензия.ИдентификаторПрограммы КАК ЛицензияИдентификаторПрограммы,
	               |	РазмещеноЛицензии.Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация КАК Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия КАК Лицензия,
	               |		СУММА(РазмещениеЛицензийОстатки.КоличествоОстаток) КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеЛицензий.Остатки(
	               |				,
	               |				ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
	               |					И ИдентификаторПрограммы.ВариантРазмещения = ЗНАЧЕНИЕ(Перечисление.ВариантыРазмещенияЛицензий.НаРабочееМесто)) КАК РазмещениеЛицензийОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия) КАК РазмещеноЛицензии
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |			РазмещениеОбъектовОстатки.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК КоличествоУстановлено
	               |		ИЗ
	               |			РегистрНакопления.РазмещениеОбъектов.Остатки(
	               |					,
	               |					ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
	               |						И ИдентификаторПрограммы.ВариантРазмещения = ЗНАЧЕНИЕ(Перечисление.ВариантыРазмещенияЛицензий.НаРабочееМесто)) КАК РазмещениеОбъектовОстатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
	               |			РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК УстановленоОбъектов
	               |		ПО РазмещеноЛицензии.ИдентификаторКомпьютера = УстановленоОбъектов.ИдентификаторКомпьютера
	               |			И РазмещеноЛицензии.ИдентификаторУстановлено = УстановленоОбъектов.ИдентификаторПрограммы
	               |ГДЕ
	               |	УстановленоОбъектов.КоличествоУстановлено ЕСТЬ NULL 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РазмещеноЛицензии.ИдентификаторКомпьютера,
	               |	РазмещеноЛицензии.ИдентификаторУстановлено,
	               |	ЕСТЬNULL(УстановленоОбъектов.КоличествоУстановлено, 0),
	               |	ИСТИНА,
	               |	РазмещеноЛицензии.Организация,
	               |	РазмещеноЛицензии.ПодразделениеОрганизации,
	               |	РазмещеноЛицензии.Лицензия,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидДвиженияНакопления.Расход),
	               |	РазмещеноЛицензии.Лицензия.ИдентификаторПрограммы,
	               |	РазмещеноЛицензии.Количество
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено КАК ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация КАК Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия КАК Лицензия,
	               |		СУММА(РазмещениеЛицензийОстатки.КоличествоОстаток) КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеЛицензий.Остатки(
	               |				,
	               |				ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)
	               |					И ИдентификаторПрограммы.ВариантРазмещения = ЗНАЧЕНИЕ(Перечисление.ВариантыРазмещенияЛицензий.НаОрганизацию)) КАК РазмещениеЛицензийОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РазмещениеЛицензийОстатки.ИдентификаторКомпьютера,
	               |		РазмещениеЛицензийОстатки.ИдентификаторУстановлено,
	               |		РазмещениеЛицензийОстатки.Организация,
	               |		РазмещениеЛицензийОстатки.ПодразделениеОрганизации,
	               |		РазмещениеЛицензийОстатки.Лицензия) КАК РазмещеноЛицензии
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КомпьютерыОрганизации.Организация КАК Организация,
	               |			ОбязательныйСофтОрганизаций.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |			КомпьютерыОрганизации.ОсновноеСредство КАК ИдентификаторКомпьютера,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КомпьютерыОрганизации.ОсновноеСредство) КАК КоличествоУстановлено
	               |		ИЗ
	               |			РегистрСведений.ОбязательныйСофтОрганизаций КАК ОбязательныйСофтОрганизаций
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(, ) КАК КомпьютерыОрганизации
	               |				ПО ОбязательныйСофтОрганизаций.Организация = КомпьютерыОрганизации.Организация
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КомпьютерыОрганизации.Организация,
	               |			ОбязательныйСофтОрганизаций.ИдентификаторПрограммы,
	               |			КомпьютерыОрганизации.ОсновноеСредство) КАК УстановленоОбъектов
	               |		ПО РазмещеноЛицензии.ИдентификаторКомпьютера = УстановленоОбъектов.ИдентификаторКомпьютера
	               |			И РазмещеноЛицензии.ИдентификаторУстановлено = УстановленоОбъектов.ИдентификаторПрограммы
	               |			И РазмещеноЛицензии.Организация = УстановленоОбъектов.Организация
	               |ГДЕ
	               |	УстановленоОбъектов.КоличествоУстановлено ЕСТЬ NULL 
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИдентификаторКомпьютера";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ЗаполнитьЖивойСофт() Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛОЖЬ КАК Флаг,
	               |	РазмещениеОбъектов.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |	РазмещениеОбъектов.ИдентификаторПрограммы КАК ИдентификаторУстановлено,
	               |	РазмещениеОбъектов.КоличествоУстановлено КАК Количество,
	               |	ЕСТЬNULL(РазмещениеЛицензийОстатки.КоличествоОстаток, 0) КАК КоличествоУстановлено,
	               |	ЕСТЬNULL(МестонахождениеОССрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	               |	ЕСТЬNULL(МестонахождениеОССрезПоследних.ПодразделениеОрганизации, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК ПодразделениеОрганизации
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РазмещениеОбъектовОстатки.ИдентификаторКомпьютера КАК ИдентификаторКомпьютера,
	               |		РазмещениеОбъектовОстатки.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК КоличествоУстановлено
	               |	ИЗ
	               |		РегистрНакопления.РазмещениеОбъектов.Остатки(, ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеОбъектовОстатки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РазмещениеОбъектовОстатки.ИдентификаторКомпьютера,
	               |		РазмещениеОбъектовОстатки.ИдентификаторПрограммы) КАК РазмещениеОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЛицензий.Остатки(, ИдентификаторПрограммы.ПризнакУчета = ЗНАЧЕНИЕ(Перечисление.ПризнакУчетаПрограмм.Учитывать)) КАК РазмещениеЛицензийОстатки
	               |		ПО РазмещениеОбъектов.ИдентификаторКомпьютера = РазмещениеЛицензийОстатки.ИдентификаторКомпьютера
	               |			И РазмещениеОбъектов.ИдентификаторПрограммы = РазмещениеЛицензийОстатки.ИдентификаторУстановлено
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних КАК МестонахождениеОССрезПоследних
	               |		ПО РазмещениеОбъектов.ИдентификаторКомпьютера = МестонахождениеОССрезПоследних.ОсновноеСредство
	               |ГДЕ
	               |	РазмещениеЛицензийОстатки.КоличествоОстаток ЕСТЬ NULL 
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИдентификаторКомпьютера";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ЗаполнитьЖивойСофт
